In [1]:
import csv
import pandas as pd
import datetime

In [2]:
path = "Chicago_calendar.csv"

In [3]:
df1 = pd.read_csv(path)

In [4]:
df1.head()

   listing_id        date available   price
0      258253  2019-11-14         t  $48.00
1      258253  2019-11-13         t  $48.00
2      258253  2019-11-12         t  $48.00
3      258253  2019-11-11         t  $48.00
4      258253  2019-11-10         t  $48.00

In [5]:
df1 = df1.sort_values(by="date",ascending= True)

In [6]:
df1.head()

         listing_id        date available    price
2771809    29982622  2018-11-15         f      NaN
1836825    24399639  2018-11-15         f      NaN
734435     14529740  2018-11-15         f      NaN
245751      5706620  2018-11-15         t  $150.00
1030645    15495723  2018-11-15         t   $99.00

In [7]:
df1.dtypes

listing_id     int64
date          object
available     object
price         object
dtype: object

In [8]:
df2 = df1
timefmt = "%Y-%m-%d" 
df2['date'] = pd.to_datetime(df2['date'], format = timefmt, errors='coerce')

In [9]:
df2.head()

         listing_id       date available    price
2771809    29982622 2018-11-15         f      NaN
1836825    24399639 2018-11-15         f      NaN
734435     14529740 2018-11-15         f      NaN
245751      5706620 2018-11-15         t  $150.00
1030645    15495723 2018-11-15         t   $99.00

In [15]:
df2 = df2.loc[(df2['date']>'2019-01-01') & (df2['date']<'2019-01-31') & (df2['available']=='t'),:]
df2.head()

         listing_id       date available    price
1525021    21814029 2019-01-02         t  $675.00
2331937    27757520 2019-01-02         t   $29.00
2724579    29679291 2019-01-02         t  $195.00
1453302    21663564 2019-01-02         t   $95.00
988433     17890798 2019-01-02         t  $139.00

In [18]:
df2.reset_index().head()

     index  listing_id       date available    price
0  1525021    21814029 2019-01-02         t  $675.00
1  2331937    27757520 2019-01-02         t   $29.00
2  2724579    29679291 2019-01-02         t  $195.00
3  1453302    21663564 2019-01-02         t   $95.00
4   988433    17890798 2019-01-02         t  $139.00

In [20]:
df2['price'].value_counts().head()

$100.00    4058
$75.00     3925
$55.00     3345
$50.00     3264
$99.00     3031
Name: price, dtype: int64